'''
1.确定解空间(一维、二维)
2.确定空间边界(每个变量最小值、最大值、步长)
3.估算时间复杂度
4.如果步骤三无法通过，通过减少枚举空间、变换枚举顺序等策略重新从1开始迭代
'''

# # x+y+z = 100
# #5x+3y+z/3 = 100
# #思路1：枚举x,y,z
# for x in range(0, 21):  # 公鸡最多20只
#     for y in range(0, 34):  # 母鸡最多33只
#         for z in range(0, 100):  # 小鸡最多99只
#             if x + y + z == 100 and 5*x + 3*y + z/3 == 100:
#                 print(f"公鸡: {x}只, 母鸡: {y}只, 小鸡: {z}只")
# #思路2：枚举x,y
# for x in range(0, 21):  # 公鸡最多20只
#     for y in range(0, 34):  # 母鸡最多33只
#         z = 100 - x - y
#         if 5*x + 3*y + z/3 == 100:
#             print(f"公鸡: {x}只, 母鸡: {y}只, 小鸡: {z}只")
#思路3：枚举x
for x in range(0, 21):  # 公鸡最多20只
    # 解方程 y = (200 - 14*x) / 8
    y = (200 - 14*x) / 8
# y = (200 - 14*x) / 8 这个表达式可能会产生一个浮点数。通过 y == int(y)，我们检查 y 是否等于它的整数部分。如果相等，说明 y 是一个整数
    if y == int(y) and 0 <= y <= 33:
        y = int(y)
        z = 100 - x - y
        if 5*x + 3*y + z/3 == 100:
            print(f"公鸡: {x}只, 母鸡: {y}只, 小鸡: {z}只")

